{
  "abacus": "An abacus is a calculating tool that has been used since ancient times, consisting of rows of beads on rods.",
  "abandon": "To abandon means to leave completely and finally; forsake utterly; desert.",
  "abandoned": "Abandoned refers to something left unused or neglected, such as a building or vehicle.",
  "abandonment": "Abandonment is the act of leaving someone or something without intending to return.",
  "abate": "To abate means to reduce in amount, degree, or intensity; lessen.",
  "abatement": "Abatement is the reduction or elimination of a nuisance or problem.",
  "abbey": "An abbey is a monastery or convent supervised by an abbot or abbess.",
  "abbot": "An abbot is the male head of an abbey of monks.",
  "abbreviate": "To abbreviate means to shorten a word or phrase by omitting letters.",
  "abbreviation": "An abbreviation is a shortened form of a word or phrase.",
  "abdicate": "To abdicate means to renounce or relinquish a throne, right, power, or responsibility.",
  "abdication": "Abdication is the formal act of stepping down from a position of power.",
  "abdomen": "The abdomen is the part of the body between the chest and pelvis containing digestive organs.",
  "abdominal": "Abdominal refers to the area of the body containing the stomach and other digestive organs.",
  "abduct": "To abduct means to carry off or lead away illegally, especially by force or fraud; kidnap.",
  "abduction": "Abduction is the act of taking someone away illegally by force or deception.",
  "abductor": "An abductor is someone who illegally takes someone away by force or deception.",
  "abeam": "Abeam means at right angles to the length of a ship or aircraft.",
  "aberrant": "Aberrant means departing from the right, normal, or usual course.",
  "aberration": "An aberration is a departure from what is normal, usual, or expected.",
  "abet": "To abet means to encourage or support someone to commit wrongdoing.",
  "abeyance": "Abeyance is a state of temporary disuse or suspension.",
  "abhor": "To abhor means to regard with extreme repugnance or aversion; detest utterly.",
  "abhorrence": "Abhorrence is a feeling of extreme repugnance or aversion.",
  "abhorrent": "Abhorrent means causing or deserving strong dislike or hatred.",
  "abide": "To abide means to accept or act in accordance with a rule or decision.",
  "abiding": "Abiding means enduring without change; lasting.",
  "ability": "Ability is the possession of the means or skill to do something.",
  "abject": "Abject means extremely bad, unpleasant, and degrading.",
  "abjure": "To abjure means to solemnly renounce a belief, cause, or claim.",
  "ablaze": "Ablaze means burning fiercely or brightly lit.",
  "able": "Able means having the power, skill, means, or opportunity to do something.",
  "able-bodied": "Able-bodied means physically fit and healthy.",
  "abloom": "Abloom means covered with or abundant in flowers; flowering.",
  "ablution": "Ablution is the act of washing oneself, often for ritual purposes.",
  "abnegation": "Abnegation is the act of renouncing or rejecting something.",
  "abnormal": "Abnormal means deviating from what is normal or usual, typically in a way that is undesirable.",
  "abnormality": "Abnormality is an abnormal feature, characteristic, or occurrence.",
  "aboard": "Aboard means on or into a ship, aircraft, train, or other vehicle.",
  "abode": "An abode is a place of residence; a house or home.",
  "abolish": "To abolish means to formally put an end to a system, practice, or institution.",
  "abolition": "Abolition is the act of abolishing a system, practice, or institution.",
  "abolitionist": "An abolitionist is a person who favors the abolition of a practice or institution.",
  "abominable": "Abominable means causing moral revulsion; very bad or unpleasant.",
  "abominable_snowman": "The Abominable Snowman is a large, hairy, humanoid creature said to live in the Himalayas.",
  "abominate": "To abominate means to detest or loathe intensely.",
  "abomination": "An abomination is a thing that causes disgust or hatred.",
  "aboriginal": "Aboriginal means inhabiting or existing in a land from the earliest times.",
  "aborigine": "An aborigine is a person, animal, or plant that has been in a country or region from earliest times.",
  "abort": "To abort means to carry out or undergo the abortion of a fetus.",
  "abortion": "Abortion is the deliberate termination of a human pregnancy.",
  "abortive": "Abortive means failing to produce the intended result.",
  "abound": "To abound means to exist in large numbers or amounts.",
  "about": "About means on the subject of; concerning.",
  "about-face": "An about-face is a complete change of attitude or opinion.",
  "above": "Above means in extended space over and not touching.",
  "aboveboard": "Aboveboard means legitimate, honest, and open.",
  "abracadabra": "Abracadabra is a word said by magicians when performing a magic trick.",
  "abrade": "To abrade means to scrape or wear away by friction or erosion.",
  "abrasion": "An abrasion is an area damaged by scraping or wearing away.",
  "abrasive": "Abrasive means showing little concern for the feelings of others; harsh.",
  "abreast": "Abreast means side by side and facing the same way.",
  "abridge": "To abridge means to shorten a book, movie, or other text without losing the sense.",
  "abridged": "Abridged means shortened without losing the essential content.",
  "abridgment": "An abridgment is a shortened version of a larger work.",
  "abroad": "Abroad means in or to a foreign country or countries.",
  "abrogate": "To abrogate means to repeal or do away with a law, right, or formal agreement.",
  "abrogation": "Abrogation is the repeal or abolition of a law, right, or agreement.",
  "abrupt": "Abrupt means sudden and unexpected.",
  "abruptly": "Abruptly means suddenly and unexpectedly.",
  "abscess": "An abscess is a swollen area within body tissue containing pus.",
  "abscissa": "An abscissa is the x-coordinate in a system of Cartesian coordinates.",
  "abscond": "To abscond means to leave hurriedly and secretly to escape from custody.",
  "abseil": "To abseil means to descend a rock face or other near-vertical surface using a rope.",
  "absence": "Absence is the state of being away from a place or person.",
  "absent": "Absent means not present in a place, at an occasion, or as part of something.",
  "absentee": "An absentee is a person who is expected or required to be present but is not.",
  "absenteeism": "Absenteeism is the practice of regularly staying away from work without good reason.",
  "absent-minded": "Absent-minded means inattentive or forgetful.",
  "absinthe": "Absinthe is a green anise-flavored liqueur.",
  "absolute": "Absolute means not qualified or diminished in any way; total.",
  "absolutely": "Absolutely means with no qualification, restriction, or limitation.",
  "absolution": "Absolution is formal release from guilt, obligation, or punishment.",
  "absolutism": "Absolutism is the acceptance of or belief in absolute principles.",
  "absolve": "To absolve means to set or declare someone free from blame, guilt, or responsibility.",
  "absorb": "To absorb means to take in or soak up liquid or another substance.",
  "absorbed": "Absorbed means deeply interested or involved.",
  "absorbent": "Absorbent means able to soak up liquid easily.",
  "absorbing": "Absorbing means intensely interesting; engrossing.",
  "absorption": "Absorption is the process by which one thing absorbs another.",
  "abstain": "To abstain means to restrain oneself from doing or enjoying something.",
  "abstainer": "An abstainer is a person who abstains from something, especially alcohol.",
  "abstemious": "Abstemious means not self-indulgent, especially when eating and drinking.",
  "abstention": "Abstention is an instance of declining to vote for or against a proposal.",
  "abstinence": "Abstinence is the practice of restraining oneself from indulging in something.",
  "abstract": "Abstract means existing in thought or as an idea but not having a physical existence.",
  "abstracted": "Abstracted means lacking concentration on what is happening around one.",
  "abstraction": "Abstraction is the quality of dealing with ideas rather than events.",
  "abstruse": "Abstruse means difficult to understand; obscure.",
  "absurd": "Absurd means wildly unreasonable, illogical, or inappropriate.",
  "absurdity": "Absurdity is the quality or state of being ridiculous or wildly unreasonable.",
  "abundance": "Abundance is a very large quantity of something.",
  "abundant": "Abundant means existing or available in large quantities; plentiful.",
  "abuse": "Abuse is the improper use of something or cruel treatment of someone.",
  "abuser": "An abuser is a person who treats someone with cruelty or violence.",
  "abusive": "Abusive means extremely offensive and insulting.",
  "abut": "To abut means to be next to or have a common boundary with.",
  "abutment": "An abutment is a structure built to support the lateral pressure of an arch or span.",
  "abuzz": "Abuzz means filled with a continuous humming or buzzing sound.",
  "abysmal": "Abysmal means extremely bad; appalling.",
  "abyss": "An abyss is a deep or seemingly bottomless chasm.",
  "abyssal": "Abyssal means relating to the depths of the ocean."
}
