{
  "abacus": "An abacus is a calculating tool that has been used since ancient times, consisting of rows of beads on rods.",
  "abandon": "To abandon means to leave completely and finally; forsake utterly; desert.",
  "abandoned": "Abandoned refers to something left unused or neglected, such as a building or vehicle.",
  "abandonment": "Abandonment is the act of leaving someone or something without intending to return.",
  "abate": "To abate means to reduce in amount, degree, or intensity; lessen.",
  "abatement": "Abatement is the reduction or elimination of a nuisance or problem.",
  "abbey": "An abbey is a monastery or convent supervised by an abbot or abbess.",
  "abbot": "An abbot is the male head of an abbey of monks.",
  "abbreviate": "To abbreviate means to shorten a word or phrase by omitting letters.",
  "abbreviation": "An abbreviation is a shortened form of a word or phrase.",
  "abdicate": "To abdicate means to renounce or relinquish a throne, right, power, or responsibility.",
  "abdication": "Abdication is the formal act of stepping down from a position of power.",
  "abdomen": "The abdomen is the part of the body between the chest and pelvis containing digestive organs.",
  "abdominal": "Abdominal refers to the area of the body containing the stomach and other digestive organs.",
  "abduct": "To abduct means to carry off or lead away illegally, especially by force or fraud; kidnap.",
  "abduction": "Abduction is the act of taking someone away illegally by force or deception.",
  "abductor": "An abductor is someone who illegally takes someone away by force or deception.",
  "abeam": "Abeam means at right angles to the length of a ship or aircraft.",
  "aberrant": "Aberrant means departing from the right, normal, or usual course.",
  "aberration": "An aberration is a departure from what is normal, usual, or expected.",
  "abet": "To abet means to encourage or support someone to commit wrongdoing.",
  "abeyance": "Abeyance is a state of temporary disuse or suspension.",
  "abhor": "To abhor means to regard with extreme repugnance or aversion; detest utterly.",
  "abhorrence": "Abhorrence is a feeling of extreme repugnance or aversion.",
  "abhorrent": "Abhorrent means causing or deserving strong dislike or hatred.",
  "abide": "To abide means to accept or act in accordance with a rule or decision.",
  "abiding": "Abiding means enduring without change; lasting.",
  "ability": "Ability is the possession of the means or skill to do something.",
  "abject": "Abject means extremely bad, unpleasant, and degrading.",
  "abjure": "To abjure means to solemnly renounce a belief, cause, or claim.",
  "ablaze": "Ablaze means burning fiercely or brightly lit.",
  "able": "Able means having the power, skill, means, or opportunity to do something.",
  "able-bodied": "Able-bodied means physically fit and healthy.",
  "abloom": "Abloom means covered with or abundant in flowers; flowering.",
  "ablution": "Ablution is the act of washing oneself, often for ritual purposes.",
  "abnegation": "Abnegation is the act of renouncing or rejecting something.",
  "abnormal": "Abnormal means deviating from what is normal or usual, typically in a way that is undesirable.",
  "abnormality": "Abnormality is an abnormal feature, characteristic, or occurrence.",
  "aboard": "Aboard means on or into a ship, aircraft, train, or other vehicle.",
  "abode": "An abode is a place of residence; a house or home.",
  "abolish": "To abolish means to formally put an end to a system, practice, or institution.",
  "abolition": "Abolition is the act of abolishing a system, practice, or institution.",
  "abolitionist": "An abolitionist is a person who favors the abolition of a practice or institution.",
  "abominable": "Abominable means causing moral revulsion; very bad or unpleasant.",
  "abominable_snowman": "The Abominable Snowman is a large, hairy, humanoid creature said to live in the Himalayas.",
  "abominate": "To abominate means to detest or loathe intensely.",
  "abomination": "An abomination is a thing that causes disgust or hatred.",
  "aboriginal": "Aboriginal means inhabiting or existing in a land from the earliest times.",
  "aborigine": "An aborigine is a person, animal, or plant that has been in a country or region from earliest times.",
  "abort": "To abort means to carry out or undergo the abortion of a fetus.",
  "abortion": "Abortion is the deliberate termination of a human pregnancy.",
  "abortive": "Abortive means failing to produce the intended result.",
  "abound": "To abound means to exist in large numbers or amounts.",
  "about": "About means on the subject of; concerning.",
  "about-face": "An about-face is a complete change of attitude or opinion.",
  "above": "Above means in extended space over and not touching.",
  "aboveboard": "Aboveboard means legitimate, honest, and open.",
  "abracadabra": "Abracadabra is a word said by magicians when performing a magic trick.",
  "abrade": "To abrade means to scrape or wear away by friction or erosion.",
  "abrasion": "An abrasion is an area damaged by scraping or wearing away.",
  "abrasive": "Abrasive means showing little concern for the feelings of others; harsh.",
  "abreast": "Abreast means side by side and facing the same way.",
  "abridge": "To abridge means to shorten a book, movie, or other text without losing the sense.",
  "abridged": "Abridged means shortened without losing the essential content.",
  "abridgment": "An abridgment is a shortened version of a larger work.",
  "abroad": "Abroad means in or to a foreign country or countries.",
  "abrogate": "To abrogate means to repeal or do away with a law, right, or formal agreement.",
  "abrogation": "Abrogation is the repeal or abolition of a law, right, or agreement.",
  "abrupt": "Abrupt means sudden and unexpected.",
  "abruptly": "Abruptly means suddenly and unexpectedly.",
  "abscess": "An abscess is a swollen area within body tissue containing pus.",
  "abscissa": "An abscissa is the x-coordinate in a system of Cartesian coordinates.",
  "abscond": "To abscond means to leave hurriedly and secretly to escape from custody.",
  "abseil": "To abseil means to descend a rock face or other near-vertical surface using a rope.",
  "absence": "Absence is the state of being away from a place or person.",
  "absent": "Absent means not present in a place, at an occasion, or as part of something.",
  "absentee": "An absentee is a person who is expected or required to be present but is not.",
  "absenteeism": "Absenteeism is the practice of regularly staying away from work without good reason.",
  "absent-minded": "Absent-minded means inattentive or forgetful.",
  "absinthe": "Absinthe is a green anise-flavored liqueur.",
  "absolute": "Absolute means not qualified or diminished in any way; total.",
  "absolutely": "Absolutely means with no qualification, restriction, or limitation.",
  "absolution": "Absolution is formal release from guilt, obligation, or punishment.",
  "absolutism": "Absolutism is the acceptance of or belief in absolute principles.",
  "absolve": "To absolve means to set or declare someone free from blame, guilt, or responsibility.",
  "absorb": "To absorb means to take in or soak up liquid or another substance.",
  "absorbed": "Absorbed means deeply interested or involved.",
  "absorbent": "Absorbent means able to soak up liquid easily.",
  "absorbing": "Absorbing means intensely interesting; engrossing.",
  "absorption": "Absorption is the process by which one thing absorbs another.",
  "abstain": "To abstain means to restrain oneself from doing or enjoying something.",
  "abstainer": "An abstainer is a person who abstains from something, especially alcohol.",
  "abstemious": "Abstemious means not self-indulgent, especially when eating and drinking.",
  "abstention": "Abstention is an instance of declining to vote for or against a proposal.",
  "abstinence": "Abstinence is the practice of restraining oneself from indulging in something.",
  "abstract": "Abstract means existing in thought or as an idea but not having a physical existence.",
  "abstracted": "Abstracted means lacking concentration on what is happening around one.",
  "abstraction": "Abstraction is the quality of dealing with ideas rather than events.",
  "abstruse": "Abstruse means difficult to understand; obscure.",
  "absurd": "Absurd means wildly unreasonable, illogical, or inappropriate.",
  "absurdity": "Absurdity is the quality or state of being ridiculous or wildly unreasonable.",
  "abundance": "Abundance is a very large quantity of something.",
  "abundant": "Abundant means existing or available in large quantities; plentiful.",
  "abuse": "Abuse is the improper use of something or cruel treatment of someone.",
  "abuser": "An abuser is a person who treats someone with cruelty or violence.",
  "abusive": "Abusive means extremely offensive and insulting.",
  "abut": "To abut means to be next to or have a common boundary with.",
  "abutment": "An abutment is a structure built to support the lateral pressure of an arch or span.",
  "abuzz": "Abuzz means filled with a continuous humming or buzzing sound.",
  "abysmal": "Abysmal means extremely bad; appalling.",
  "abyss": "An abyss is a deep or seemingly bottomless chasm.",
  "abyssal": "Abyssal means relating to the depths of the ocean.",
  "acacia": "An acacia is a tree or shrub of warm climates with clusters of yellow or white flowers.",
  "academic": "Academic means relating to education and scholarship.",
  "academy": "An academy is a place of study or training in a special field.",
  "accede": "To accede means to agree to a demand, request, or treaty.",
  "accelerate": "To accelerate means to increase in speed or amount.",
  "acceleration": "Acceleration is the increase in speed or rate of something.",
  "accelerator": "An accelerator is a device for increasing speed.",
  "accent": "An accent is a distinctive way of pronouncing a language.",
  "accentuate": "To accentuate means to make more noticeable or prominent.",
  "accept": "To accept means to consent to receive or undertake something offered.",
  "acceptable": "Acceptable means able to be agreed on; suitable.",
  "acceptance": "Acceptance is the action of consenting to receive or undertake something offered.",
  "accepted": "Accepted means generally believed or recognized to be valid or correct.",
  "access": "Access is the means or opportunity to approach or enter a place.",
  "accessible": "Accessible means able to be reached or entered.",
  "accession": "Accession is the attainment or acquisition of a position of rank or power.",
  "accessory": "An accessory is a thing that can be added to something else to make it more useful.",
  "accident": "An accident is an unfortunate incident that happens unexpectedly.",
  "accidental": "Accidental means happening by chance or without intention.",
  "acclaim": "Acclaim is enthusiastic and public praise.",
  "acclaimed": "Acclaimed means publicly praised or celebrated.",
  "acclamation": "Acclamation is loud and enthusiastic approval.",
  "acclimate": "To acclimate means to become accustomed to a new climate or conditions.",
  "acclimatize": "To acclimatize means to become accustomed to a new climate or conditions.",
  "accolade": "An accolade is an award or privilege granted as a special honor.",
  "accommodate": "To accommodate means to provide lodging or sufficient space for.",
  "accommodating": "Accommodating means willing to fit in with someone's wishes or needs.",
  "accommodation": "Accommodation is a room, group of rooms, or building for someone to live in.",
  "accompaniment": "An accompaniment is a musical part that supports or partners a solo instrument.",
  "accompanist": "An accompanist is a person who provides a musical accompaniment.",
  "accompany": "To accompany means to go somewhere with someone as a companion.",
  "accomplice": "An accomplice is a person who helps another commit a crime.",
  "accomplish": "To accomplish means to achieve or complete successfully.",
  "accomplished": "Accomplished means highly trained or skilled in a particular activity.",
  "accomplishment": "An accomplishment is something that has been achieved successfully.",
  "accord": "An accord is an official agreement or treaty.",
  "accordance": "Accordance means in a manner conforming with.",
  "according": "According means as stated by or in.",
  "accordingly": "Accordingly means in a way that is appropriate to the particular circumstances.",
  "accordion": "An accordion is a musical instrument played by stretching and squeezing with the hands.",
  "accost": "To accost means to approach and address someone boldly or aggressively.",
  "account": "An account is a report or description of an event or experience.",
  "accountable": "Accountable means required or expected to justify actions or decisions.",
  "accountancy": "Accountancy is the profession or duties of an accountant.",
  "accountant": "An accountant is a person who keeps or inspects financial accounts.",
  "accounting": "Accounting is the process of keeping financial accounts.",
  "accredit": "To accredit means to give credit or recognition to.",
  "accredited": "Accredited means officially recognized or authorized.",
  "accretion": "Accretion is growth or increase by the gradual accumulation of additional layers.",
  "accrue": "To accrue means to accumulate or receive payments or benefits over time.",
  "accumulate": "To accumulate means to gather together or acquire an increasing number of something.",
  "accumulation": "Accumulation is the acquisition or gradual gathering of something.",
  "accumulator": "An accumulator is a rechargeable device for storing electrical energy.",
  "accuracy": "Accuracy is the quality or state of being correct or precise.",
  "accurate": "Accurate means correct in all details; exact.",
  "accurately": "Accurately means in a way that is correct or exact.",
  "accursed": "Accursed means under a curse or doomed to evil or misery.",
  "accusation": "An accusation is a charge or claim that someone has done something illegal or wrong.",
  "accusative": "Accusative is a grammatical case used for the object of a verb.",
  "accuse": "To accuse means to charge someone with an offense or crime.",
  "accused": "The accused is a person or group of people charged with a crime.",
  "accuser": "An accuser is a person who claims that someone has committed an offense.",
  "accusing": "Accusing means suggesting that one believes someone has done something wrong.",
  "accustom": "To accustom means to make someone or something accept something as normal.",
  "accustomed": "Accustomed means customary or usual.",
  "ace": "An ace is a playing card with a single spot on it, ranked as the highest card.",
  "acerbic": "Acerbic means sharp and forthright, especially in speech.",
  "acetate": "Acetate is a salt or ester of acetic acid.",
  "acetic": "Acetic means relating to or containing acetic acid or vinegar.",
  "acetone": "Acetone is a colorless volatile liquid used as a solvent.",
  "acetylene": "Acetylene is a colorless gas used as a fuel in welding.",
  "ache": "An ache is a continuous or prolonged dull pain in a part of the body.",
  "achieve": "To achieve means to successfully bring about or reach a desired objective.",
  "achievement": "An achievement is a thing done successfully with effort, skill, or courage.",
  "aching": "Aching means sore or painful.",
  "achromatic": "Achromatic means without color.",
  "acid": "An acid is a chemical substance that neutralizes alkalis and turns litmus red.",
  "acidic": "Acidic means having the properties of an acid or containing acid.",
  "acidity": "Acidity is the level of acid in substances such as water or soil.",
  "acidosis": "Acidosis is an excessively acid condition of the body fluids or tissues.",
  "acid_test": "An acid test is a conclusive test of the success or value of something.",
  "acknowledge": "To acknowledge means to accept or admit the existence or truth of.",
  "acknowledged": "Acknowledged means recognized as being good or important.",
  "acknowledgment": "An acknowledgment is the act of admitting or recognizing something.",
  "acme": "The acme is the point at which someone or something is best, perfect, or most successful.",
  "acne": "Acne is a skin condition characterized by red pimples on the skin.",
  "acolyte": "An acolyte is a person assisting a priest in a religious service.",
  "aconite": "Aconite is a poisonous plant with hooded pink or purple flowers.",
  "acorn": "An acorn is the fruit of the oak tree, a smooth oval nut in a rough cup.",
  "acoustic": "Acoustic means relating to sound or the sense of hearing.",
  "acoustics": "Acoustics is the science concerned with the properties of sound.",
  "acquaint": "To acquaint means to make someone aware of or familiar with.",
  "acquaintance": "An acquaintance is a person one knows slightly but not as a close friend.",
  "acquainted": "Acquainted means having knowledge or experience of a particular thing.",
  "acquiesce": "To acquiesce means to accept something reluctantly but without protest.",
  "acquiescence": "Acquiescence is the reluctant acceptance of something without protest.",
  "acquire": "To acquire means to buy or obtain an asset or object for oneself.",
  "acquisition": "An acquisition is an asset or object bought or obtained.",
  "acquisitive": "Acquisitive means excessively interested in acquiring money or material things.",
  "acquit": "To acquit means to free someone from a criminal charge by a verdict of not guilty.",
  "acquittal": "An acquittal is a judgment that a person is not guilty of the crime with which they have been charged.",
  "acre": "An acre is a unit of land area equal to 4,840 square yards.",
  "acreage": "Acreage is an area of land measured in acres.",
  "acrid": "Acrid means having an irritatingly strong and unpleasant taste or smell.",
  "acrimonious": "Acrimonious means angry and bitter, typically in speech or debate.",
  "acrimony": "Acrimony is bitterness or ill feeling.",
  "acrobat": "An acrobat is an entertainer who performs spectacular gymnastic feats.",
  "acrobatic": "Acrobatic means involving or performing spectacular gymnastic feats.",
  "acrobatics": "Acrobatics is gymnastic feats requiring skillful control of the body.",
  "acronym": "An acronym is a word formed from the initial letters of other words.",
  "acropolis": "An acropolis is a citadel or fortified part of an ancient Greek city.",
  "across": "Across means from one side to the other of a place, area, etc.",
  "acrostic": "An acrostic is a poem or puzzle where certain letters in each line form a word.",
  "acrylic": "Acrylic is a synthetic material used especially in paints and textiles.",
  "act": "An act is a thing done; a deed.",
  "acting": "Acting is the art or occupation of performing in plays, movies, etc.",
  "actinium": "Actinium is a radioactive chemical element with symbol Ac and atomic number 89.",
  "action": "Action is the fact or process of doing something.",
  "actionable": "Actionable means giving sufficient reason to take legal action.",
  "activate": "To activate means to make something active or operative.",
  "activation": "Activation is the action or process of making something active.",
  "active": "Active means engaging or ready to engage in physically energetic pursuits.",
  "activism": "Activism is the policy or action of using vigorous campaigning to bring about political or social change.",
  "activist": "An activist is a person who campaigns to bring about political or social change.",
  "activity": "Activity is the condition in which things are happening or being done.",
  "actor": "An actor is a person whose profession is acting on the stage, in movies, or on television.",
  "actress": "An actress is a female actor.",
  "actual": "Actual means existing in fact; real.",
  "actuality": "Actuality is the state of existing in reality.",
  "actualize": "To actualize means to make a reality of something.",
  "actually": "Actually means as the truth or facts of a situation.",
  "actuary": "An actuary is a person who compiles and analyzes statistics for insurance purposes.",
  "actuate": "To actuate means to cause a machine or device to operate.",
  "acuity": "Acuity is sharpness or keenness of thought, vision, or hearing.",
  "acumen": "Acumen is the ability to make good judgments and quick decisions.",
  "acupuncture": "Acupuncture is a system of complementary medicine involving pricking the skin with needles.",
  "acute": "Acute means present or experienced to a severe or intense degree.",
  "acutely": "Acutely means to a severe or intense degree.",
  "adage": "An adage is a proverb or short statement expressing a general truth."
}
